АлогистикТест2/src/DataProcessors/ГрафическоеОтображениеСушКомплекса/ГрафическоеОтображениеСушКомплекса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ГрафическоеОтображениеСушКомплекса</name>
</mdclass:DataProcessor>

АлогистикТест2/src/InformationRegisters/алк_СостояниеСушильныхКамер/алк_СостояниеСушильныхКамер.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алк_СостояниеСушильныхКамер</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Неисправна</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>СушильнаяКамера</name>
    <type>
      <types>CatalogRef.алк_Штабели</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/AccumulationRegisters/алк_ПроизводствоОборот/алк_ПроизводствоОборот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>алк_ПроизводствоОборот</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.алк_Количество</types>
    </type>
  </resources>
  <dimensions>
    <name>Бригада</name>
    <type>
      <types>CatalogRef.Бригады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидДвиженияПроизводства</name>
    <type>
      <types>EnumRef.алк_ВидыДвиженияПроизводствоОборот</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Операция</name>
    <type>
      <types>CatalogRef.алк_ОперацииПроизводства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СерийныйНомер</name>
    <type>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сертификат</name>
    <type>
      <types>CatalogRef.СертификатыНаПродукцию</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Штабель</name>
    <type>
      <types>CatalogRef.алк_Штабели</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

АлогистикТест2/src/Enums/алк_НаправленияДеятельности/алк_НаправленияДеятельности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>алк_НаправленияДеятельности</name>
  <enumValues>
    <name>ДревесныеГранулы</name>
  </enumValues>
  <enumValues>
    <name>Лесопиление</name>
  </enumValues>
  <enumValues>
    <name>Отходы</name>
  </enumValues>
  <enumValues>
    <name>МалоеЛесопиление</name>
  </enumValues>
  <enumValues>
    <name>Шпон</name>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/Enums/алк_ВидыДвиженияПроизводствоОборот/алк_ВидыДвиженияПроизводствоОборот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>алк_ВидыДвиженияПроизводствоОборот</name>
  <enumValues>
    <name>Списано</name>
  </enumValues>
  <enumValues>
    <name>Оприходовано</name>
  </enumValues>
  <enumValues>
    <name>Отходы</name>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/Documents/алк_ВыгрузкаИзКамеры/алк_ВыгрузкаИзКамеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_ВыгрузкаИзКамеры</name>
  <basedOn>Document.алк_ЗагрузкаВСушильнуюКамеру</basedOn>
  <basedOn>Document.алк_ЗагрузкаВКамеру</basedOn>
  <registerRecords>AccumulationRegister.алк_ЗапасыОрганизации</registerRecords>
  <registerRecords>AccumulationRegister.алк_ЗапасыНаСкладахСерии</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОстаткиЗапасов</registerRecords>
  <registerRecords>AccumulationRegister.алк_ПроизводствоОборот</registerRecords>
  <registerRecords>AccumulationRegister.алк_ПакетыВСушильныхКамерах</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОстаткиЛесопродукции</registerRecords>
  <registerRecords>AccumulationRegister.алк_ПиломатериалыПереданныеНаСушку</registerRecords>
  <registerRecords>InformationRegister.алк_ПараметрыПакетов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.алк_ЗагрузкаВКамеру</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СушильнаяКамера</name>
    <type>
      <types>CatalogRef.алк_Штабели</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШтабельПолучателя</name>
    <type>
      <types>CatalogRef.алк_Штабели</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиницаПолучатель</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>СобственнымиСилами</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Номенклатура</name>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <type>
        <types>CatalogRef.СертификатыНаПродукцию</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Продан</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/Documents/алк_ЗагрузкаВКамеру/алк_ЗагрузкаВКамеру.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_ЗагрузкаВКамеру</name>
  <registerRecords>AccumulationRegister.алк_ЗапасыОрганизации</registerRecords>
  <registerRecords>AccumulationRegister.алк_ЗапасыНаСкладахСерии</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОстаткиЗапасов</registerRecords>
  <registerRecords>AccumulationRegister.алк_ПроизводствоОборот</registerRecords>
  <registerRecords>AccumulationRegister.алк_ПакетыВСушильныхКамерах</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОстаткиЛесопродукции</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СушильнаяКамера</name>
    <type>
      <types>CatalogRef.алк_Штабели</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>EnumRef.алк_НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиницаПолучатель</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыгрузки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Техкарта</name>
    <type>
      <types>CatalogRef.алк_ТехкартаСушки</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗапуска</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОстанова</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦелеваяВлажность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачальнаяВлажностьСредняя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонечнаяВлажностьСредняя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонечнаяВлажностьФактСредняя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Режим</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимКомментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СобственнымиСилами</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Номенклатура</name>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <type>
        <types>CatalogRef.СертификатыНаПродукцию</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Продан</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НачальнаяВлажность</name>
    <attributes>
      <name>Влажность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонечнаяВлажность</name>
    <attributes>
      <name>Влажность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонечнаяВлажностьФакт</name>
    <attributes>
      <name>Влажность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/DataProcessors/ГрафическоеОтображениеСушКомплекса/Forms/ФормаВторогоУровня/Module.bsl
#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИзменитьЦветВнеШтабеля(Остаток,ИмяСклада)
		
	Если Остаток <> 0 Тогда
		Элементы[Формат("Остатки" + ИмяСклада + "ВнеШтабеля","ЧГ=0")].ЦветТекстаЗаголовка = НазначитьЦвет().Красный;
	Иначе
		Элементы[Формат("Остатки" + ИмяСклада + "ВнеШтабеля","ЧГ=0")].ЦветТекстаЗаголовка = НазначитьЦвет().Черный;	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВывестиОстаткиПоСкладам(Склады)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВЫБОР
	               |		КОГДА алк_ОстаткиЗапасовОстатки.СтруктурнаяЕдиница.Код = ""00-000005""
	               |			ТОГДА ""СушильныйБуфер""
	               |		КОГДА алк_ОстаткиЗапасовОстатки.СтруктурнаяЕдиница.Код = ""ПБ-000031""
	               |			ТОГДА ""СушильныйКомплекс1""
	               |		КОГДА алк_ОстаткиЗапасовОстатки.СтруктурнаяЕдиница.Код = ""ПБ-000090""
	               |			ТОГДА ""СушильныйКомплекс2""
	               |		КОГДА алк_ОстаткиЗапасовОстатки.СтруктурнаяЕдиница = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.Ангар)
	               |			ТОГДА ""Ангар1""
	               |		КОГДА алк_ОстаткиЗапасовОстатки.СтруктурнаяЕдиница.Код = ""ПБ-000098""
	               |			ТОГДА ""Ангар2""
	               |		ИНАЧЕ ""ХолоднаяЗона""
	               |	КОНЕЦ КАК Склад,
	               |	СУММА(ЕСТЬNULL(алк_ОстаткиЗапасовОстатки.КоличествоОстаток, 0)) КАК ОстатокПоСкладу,
	               |	СУММА(ЕСТЬNULL(алк_ОстаткиЗапасовОстатки1.КоличествоОстаток, 0)) КАК ОстатокВнеСклада
	               |ИЗ
	               |	РегистрНакопления.алк_ОстаткиЗапасов.Остатки(
	               |			,
	               |			СтруктурнаяЕдиница В (&Склады)
	               |				И Номенклатура.КатегорияНоменклатуры = &Номенклатура) КАК алк_ОстаткиЗапасовОстатки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.алк_ОстаткиЗапасов.Остатки(
	               |				,
	               |				СтруктурнаяЕдиница В (&Склады)
	               |					И Номенклатура.КатегорияНоменклатуры = &Номенклатура
	               |					И Штабель = ЗНАЧЕНИЕ(Справочник.алк_Штабели.ПустаяСсылка)) КАК алк_ОстаткиЗапасовОстатки1
	               |		ПО алк_ОстаткиЗапасовОстатки.СтруктурнаяЕдиница = алк_ОстаткиЗапасовОстатки1.СтруктурнаяЕдиница
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВЫБОР
	               |		КОГДА алк_ОстаткиЗапасовОстатки.СтруктурнаяЕдиница.Код = ""00-000005""
	               |			ТОГДА ""СушильныйБуфер""
	               |		КОГДА алк_ОстаткиЗапасовОстатки.СтруктурнаяЕдиница.Код = ""ПБ-000031""
	               |			ТОГДА ""СушильныйКомплекс1""
	               |		КОГДА алк_ОстаткиЗапасовОстатки.СтруктурнаяЕдиница.Код = ""ПБ-000090""
	               |			ТОГДА ""СушильныйКомплекс2""
	               |		КОГДА алк_ОстаткиЗапасовОстатки.СтруктурнаяЕдиница = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.Ангар)
	               |			ТОГДА ""Ангар1""
	               |		КОГДА алк_ОстаткиЗапасовОстатки.СтруктурнаяЕдиница.Код = ""ПБ-000098""
	               |			ТОГДА ""Ангар2""
	               |		ИНАЧЕ ""ХолоднаяЗона""
	               |	КОНЕЦ";
	
	Запрос.УстановитьПараметр("Склады", Склады);
	Запрос.УстановитьПараметр("Номенклатура", НазначитьКатегориюНоменклатуры());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		
		ЭтаФорма[Формат("Остатки" + Выборка.Склад,"ЧГ=0")] = Выборка.ОстатокПоСкладу;
		Если Выборка.Склад <> "СушильныйБуфер" Тогда  
			ЭтаФорма[Формат("Остатки" + Выборка.Склад + "ВнеШтабеля","ЧГ=0")] = Выборка.ОстатокВнеСклада;
			ИзменитьЦветВнеШтабеля(Выборка.ОстатокВнеСклада, Выборка.Склад);
		КонецЕсли;
		
	КонецЦикла; 
	
	//заполнение суш комплекса полностью  
	ОстаткиСушильныйКомплекс = ОстаткиСушильныйКомплекс1 + ОстаткиСушильныйКомплекс2;
	ОстаткиСушильныйКомплексВнеШтабеля = ОстаткиСушильныйКомплекс1ВнеШтабеля + ОстаткиСушильныйКомплекс2ВнеШтабеля;
	
	ИзменитьЦветВнеШтабеля(ОстаткиСушильныйКомплексВнеШтабеля, "СушильныйКомплекс");
	//\\
	
	//заполнение Ангаров 
	ОстаткиАнгарыВсего = ОстаткиАнгар1 + ОстаткиАнгар2;
	
	ОстаткиАнгарыВнеШтабеля = ОстаткиАнгар1ВнеШтабеля + ОстаткиАнгар2ВнеШтабеля;
	
	ИзменитьЦветВнеШтабеля(ОстаткиАнгарыВнеШтабеля, "Ангары");
	//\\
	                         			
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВозвратСменыИДатыСменыПоТекДате() 
	Возврат РфпПолучениеДанныхСервер.ПолучитьПараметрыСменыПоДате(Справочники.алк_Участки.НайтиПоКоду("000000024"), ТекущаяДата());	
КонецФункции

&НаСервере
Процедура ПерезаполнитьНеЗаполненныеШтабели(СШтабеля,ПоШтабель, МассивЗаполненныхШтабелей, НазваниеРеквизитаОбъем,  НазваниеРеквизитаКоличество, НазваниеРеквизитаГруппа,ДляАнгара2)
		
	Для счетчик = СШтабеля По ПоШтабель Цикл 
		
		штабель = счетчик;
		
		Если ДляАнгара2 Тогда 
			штабель = "2"+ штабель;
		КонецЕсли;
		
		Если МассивЗаполненныхШтабелей.Найти(Строка(штабель)) = Неопределено ИЛИ МассивЗаполненныхШтабелей.Количество() = 0 Тогда 
			
			//очистить объем штабеля
			ЭтаФорма[Формат(НазваниеРеквизитаОбъем+штабель,"ЧГ=0")] = ""; 
			//очистить количество пакетов
			ЭтаФорма[Формат(НазваниеРеквизитаКоличество+штабель,"ЧГ=0")] = "";
			//цвет группы
			Элементы[Формат(НазваниеРеквизитаГруппа+штабель,"ЧГ=0")].ЦветФона = НазначитьЦвет().Белый; 
			//\\
			
		КонецЕсли;
	КонецЦикла;   
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция УстановитьНомерКамерыПоШтабелю(Штабель)
	
	//устанавливаем номер штабеля
	НомерЧВхождения = СтрНайти(Штабель,"№");
	ЦифрыНомера = Сред(Штабель,НомерЧВхождения+2);
	//\\ 
	
	Если Штабель.Владелец = НазначитьСклад().СушильныйКомплекс2 Тогда 
		ЦифрыНомера = "2"+ЦифрыНомера;
	КонецЕсли;
	
	Если Штабель.Владелец = НазначитьСклад().Ангар2 Тогда 
		ЦифрыНомера = "2"+ЦифрыНомера;
	КонецЕсли;
	
	Возврат ЦифрыНомера;   
	
КонецФункции

&НаСервере
Процедура ЗаполнениеШтабеля(Штабель, ЗаполняютСушильныеКамеры, ЗаполняютАнгар, ЗаполняютХолоднуюЗону, ДатаЗагрузкиКамеры, ДатаВыгрузкиКамеры, ДокументЗагрузки, Объем, КоличествоПакетов, ЦветГруппы )
	
	ЦифрыНомера = УстановитьНомерКамерыПоШтабелю(Штабель);
	
	Если ЗаполняютСушильныеКамеры Тогда   
		
		//добавить дату загрузки
		ЭтаФорма[Формат("ДатаЗагрузки"+ЦифрыНомера,"ЧГ=0")] = ДатаЗагрузкиКамеры; 
		//добавить дату выгрузки
		ЭтаФорма[Формат("ДатаПредполагаемойВыгрузки"+ЦифрыНомера,"ЧГ=0")] = ДатаВыгрузкиКамеры;
		//добавить документ загрузки
		ЭтаФорма[Формат("ДокументЗагрузки"+ЦифрыНомера,"ЧГ=0")] = ДокументЗагрузки;
		
		//цвет группы
		Элементы[Формат("Группа2"+ЦифрыНомера,"ЧГ=0")].ЦветФона = ЦветГруппы; 
		//\\ 
		
		Возврат;
	КонецЕсли;
	
	Если ЗаполняютАнгар Тогда
		
		//добавить объем на штабель
		ЭтаФорма[Формат("ОстатокОбъемАнгар"+ЦифрыНомера,"ЧГ=0")] = Объем; 
		//добавить количество пакетов
		ЭтаФорма[Формат("ОстатокКоличествоАнгар"+ЦифрыНомера,"ЧГ=0")] = КоличествоПакетов;
		
		//цвет группы
		Элементы[Формат("ГруппаА"+ЦифрыНомера,"ЧГ=0")].ЦветФона = ЦветГруппы; 
		//\\
		
		Возврат;
	КонецЕсли;  

	
	Если ЗаполняютХолоднуюЗону Тогда
		
		//добавить объем на штабель
		ЭтаФорма[Формат("ОстатокОбъемХЗ"+ЦифрыНомера,"ЧГ=0")] = Объем; 
		//добавить количество пакетов
		ЭтаФорма[Формат("ОстатокКоличествоХЗ"+ЦифрыНомера,"ЧГ=0")] = КоличествоПакетов;
		
		//цвет группы
		Элементы[Формат("Группа3"+ЦифрыНомера,"ЧГ=0")].ЦветФона = ЦветГруппы; 
		//\\
		
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НазначитьКатегориюНоменклатуры()
	
	Возврат ПредопределенноеЗначение("Справочник.КатегорииНоменклатуры.ПиломатериалСП");
	
КонецФункции

&НаСервереБезКонтекста
Функция НазначитьСклад()
	
	Склады = Новый Структура;
	
	Склады.Вставить("ХолоднаяЗона", ПредопределенноеЗначение("Справочник.СтруктурныеЕдиницы.ХолоднаяЗона"));
	Склады.Вставить("Ангар1", ПредопределенноеЗначение("Справочник.СтруктурныеЕдиницы.Ангар"));
	Склады.Вставить("СушильныйКомплекс1", Справочники.СтруктурныеЕдиницы.НайтиПоКоду("ПБ-000031")); 
	Склады.Вставить("СушильныйКомплекс2", Справочники.СтруктурныеЕдиницы.НайтиПоКоду("ПБ-000090"));  
	Склады.Вставить("СушильныйБуфер", ПредопределенноеЗначение("Справочник.СтруктурныеЕдиницы.СушильныйБуфер"));
	Склады.Вставить("Ангар2", Справочники.СтруктурныеЕдиницы.НайтиПоКоду("ПБ-000098"));

	Возврат Склады;
	
КонецФункции 
//все склады
&НаСервереБезКонтекста
Функция МассивСкладов()
	
	//Массив складов 
	Склады = Новый Массив;
	
	СтруктураСкладов = НазначитьСклад();
	
	Склады.Добавить(СтруктураСкладов.Ангар1); 
	Склады.Добавить(СтруктураСкладов.Ангар2); 
	Склады.Добавить(СтруктураСкладов.ХолоднаяЗона);
	Склады.Добавить(СтруктураСкладов.СушильныйКомплекс1);
	Склады.Добавить(СтруктураСкладов.СушильныйКомплекс2); 
	Склады.Добавить(СтруктураСкладов.СушильныйБуфер); 
	//\\ 
	
	Возврат Склады;
	
КонецФункции

&НаСервереБезКонтекста
Функция ТекстЗапросаОстаткиПоШтабелю()
	
	Запрос = Новый Запрос;
	
	Запрос.Текст ="ВЫБРАТЬ
	              |	алк_ОстаткиЗапасовОстатки.Штабель КАК Штабель,
	              |	СУММА(алк_ОстаткиЗапасовОстатки.КоличествоОстаток) КАК Объем,
	              |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ алк_ОстаткиЗапасовОстатки.СерийныйНомер) КАК КоличествоПакетов
	              |ИЗ
	              |	РегистрНакопления.алк_ОстаткиЗапасов.Остатки(
	              |			,
	              |			Номенклатура.КатегорияНоменклатуры = &ПиломатериалСП
	              |				И СтруктурнаяЕдиница В (&СтруктурнаяЕдиница)) КАК алк_ОстаткиЗапасовОстатки
	              |
	              |СГРУППИРОВАТЬ ПО
	              |	алк_ОстаткиЗапасовОстатки.Штабель";
	
	Возврат Запрос.Текст;
	
КонецФункции
//Ангар или Холодная зона
&НаСервере
Функция ПолучитьСклад(ПодстрокаПоиска, НомерВхожения, НомерКамерыИзОкончанияКоманды)
	
	ИмяКоманды = ЭтаФорма.ТекущийЭлемент.Имя;
	ЧислоВхожденияСклада = СтрНайти(ИмяКоманды,ПодстрокаПоиска,,,НомерВхожения);
	ПерваяБукваСклада = Сред(ИмяКоманды,ЧислоВхожденияСклада+1,1);
	
	Если ПерваяБукваСклада = "А" Тогда   
		Если Лев(НомерКамерыИзОкончанияКоманды,1) = "2" И СтрДлина(НомерКамерыИзОкончанияКоманды) <> 1 Тогда 
			Возврат НазначитьСклад().Ангар2;
		Иначе
			Возврат НазначитьСклад().Ангар1;
		КонецЕсли;
	Иначе 
		Возврат НазначитьСклад().ХолоднаяЗона;
	КонецЕсли;
		
КонецФункции

&НаСервере
Функция ПолучитьНомерКамерыПоТекущемуЭлементу(ПодстрокаПоиска, НомерВхожения)
	
	ИмяКоманды = ЭтаФорма.ТекущийЭлемент.Имя;
	ЧислоВхожденияНомераКамеры = СтрНайти(ИмяКоманды,ПодстрокаПоиска,,,НомерВхожения);
	НомерКамеры = Сред(ИмяКоманды,ЧислоВхожденияНомераКамеры+1);
	
	Возврат НомерКамеры;
	
КонецФункции

&НаКлиенте
Процедура ВызватьФормуСодержаниеКамеры(Склад, Штабель, Номенклатура)
		
	ПараметрыФормы = Новый Структура;
		
	ПараметрыФормы.Вставить("Склад", Склад); 
	ПараметрыФормы.Вставить("Штабель", Штабель);     
	ПараметрыФормы.Вставить("Номенклатура", Номенклатура);   
		
	ОткрытьФорму("Обработка.ГрафическоеОтображениеСушКомплекса.Форма.СерийныеНомераНаШтабеле", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервереБезКонтекста                                                  
Функция НазначитьЦвет()
	
	ПалитраЦветов = Новый Структура;
	ПалитраЦветов.Вставить("Белый",Новый Цвет(255,255,255));
	ПалитраЦветов.Вставить("Розовый",Новый Цвет(255,192,203)); 
	ПалитраЦветов.Вставить("Зеленый",Новый Цвет(192,220,192));
	ПалитраЦветов.Вставить("Коричневый",Новый Цвет(203, 161, 127));   
	ПалитраЦветов.Вставить("Голубой",Новый Цвет(153, 204, 255));
	ПалитраЦветов.Вставить("Красный",Новый Цвет(255, 0, 0));
	ПалитраЦветов.Вставить("Черный",Новый Цвет(0, 0, 0));
	ПалитраЦветов.Вставить("Серый",Новый Цвет(178, 178, 178));
	
	Возврат ПалитраЦветов;   
	
КонецФункции

&НаСервере
Процедура ОбновитьДанныеНаФормеНаСервере()  
	
	ТекВкладка = Элементы.Группа126.ТекущаяСтраница.Имя; 
	
	СтруктураСкладов = НазначитьСклад();
	
	Если ТекВкладка = "Группа127" Тогда //суш камеры по суш комплексу №1 и №2 + буфер
		ЗаполнитьСушильныйКомплекс();
		ВывестиОстаткиПоСкладам(ПолучитьМассивСкладовСушКомплекса()); 
		ПроверкаКамерНаВыгрузку(Истина);
		УстановитьНеисправностьКамер();
	ИначеЕсли ТекВкладка = "Группа128" Тогда  //Ангар1 и Ангар2
		ЗаполнитьАнгар(Истина);
		ВывестиОстаткиПоСкладам(МассивАнгаров()); 
	Иначе 
		ЗаполнитьХолоднаяЗона(Истина);    //Холодная зона 
		ВывестиОстаткиПоСкладам(СтруктураСкладов.ХолоднаяЗона); 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанныеНаФорме()  
	
	ОбновитьДанныеНаФормеНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ВыгрузитьКамеруНаСервере(НомерКамеры, ДанныеФормы)
		
	ДокВыгрузки = Документы.алк_ВыгрузкаИзКамеры.СоздатьДокумент();  
	
	ДокВыгрузки.Заполнить(ЭтаФорма[Формат("ДокументЗагрузки"+НомерКамеры,"ЧГ=0")]);
	
	//заполняем данные документа
	ДокВыгрузки.Дата = ТекущаяДата();
	
	ПараметрыСмены = ВозвратСменыИДатыСменыПоТекДате();
	Если НЕ ПараметрыСмены = NULL Тогда 	
		ДокВыгрузки.ДатаСмены = ПараметрыСмены.ДатаСмены;
		
		ДокВыгрузки.Смена = ПараметрыСмены.Смена; 
	КонецЕсли; 
	
	ДокВыгрузки.Участок = Справочники.алк_Участки.НайтиПоКоду("000000024");
	
	ЗначениеВДанныеФормы(ДокВыгрузки,ДанныеФормы);
		
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗагрузитьКамеруНаСервере(ДанныеФормы,НомерКамеры)
	
	ВсеСклады = НазначитьСклад();
	
	Если Сред(НомерКамеры,1,1) = "2" И СтрДлина(НомерКамеры) <> 1 Тогда 
		СкладПолучатель = ВсеСклады.СушильныйКомплекс2;
		НомерКамеры = Сред(НомерКамеры,2);
	Иначе 
		СкладПолучатель = ВсеСклады.СушильныйКомплекс1; 
	КонецЕсли;

	
	ДокЗагрузки = Документы.алк_ЗагрузкаВКамеру.СоздатьДокумент();  
	
	//заполняем данные документа
	ДокЗагрузки.Дата = ТекущаяДата();  
	
	ПараметрыСмены = ВозвратСменыИДатыСменыПоТекДате();
	Если НЕ ПараметрыСмены = NULL Тогда 	
		ДокЗагрузки.ДатаСмены = ПараметрыСмены.ДатаСмены;
		
		ДокЗагрузки.Смена = ПараметрыСмены.Смена; 
	КонецЕсли;   
	
	ДокЗагрузки.Направление = ПредопределенноеЗначение("Перечисление.алк_НаправленияДеятельности.Лесопиление");
	ДокЗагрузки.Организация = ПредопределенноеЗначение("Справочник.Организации.ОсновнаяОрганизация");
	ДокЗагрузки.СтруктурнаяЕдиница = ПредопределенноеЗначение("Справочник.СтруктурныеЕдиницы.СушильныйБуфер");
	ДокЗагрузки.СтруктурнаяЕдиницаПолучатель = СкладПолучатель; 
	ДокЗагрузки.Участок = Справочники.алк_Участки.НайтиПоКоду("000000024"); //Сушильные камеры
	ДокЗагрузки.Ответственный = ПользователиКлиентСервер.ТекущийПользователь();
	ДокЗагрузки.СушильнаяКамера = ПолучитьШтабель("Сушильная камера № " + НомерКамеры,СкладПолучатель);
	//\\
	
	ЗначениеВДанныеФормы(ДокЗагрузки,ДанныеФормы);
	
КонецПроцедуры 
//по наименованию и складу
&НаСервереБезКонтекста
Функция ПолучитьШтабель(Наименование,Склад) 
	
	Запрос = Новый Запрос;
	
	Запрос.Текст ="ВЫБРАТЬ
	              |	алк_Штабели.Ссылка
	              |ИЗ
	              |	Справочник.алк_Штабели КАК алк_Штабели
	              |ГДЕ
	              |	алк_Штабели.Наименование ПОДОБНО ""%"" + &Наименование
	              |	И алк_Штабели.Владелец = &Владелец"; 
	
	Запрос.УстановитьПараметр("Наименование", Наименование); 
	Запрос.УстановитьПараметр("Владелец", Склад);
		
	Возврат Запрос.Выполнить().Выгрузить()[0].Ссылка; 

КонецФункции

&НаСервереБезКонтекста                                                  
Процедура ДобавитьЗаписьОСостоянииКамеры(СушКамера,Неисправна) 
	РегистрыСведений.алк_СостояниеСушильныхКамер.ДобавитьЗапись(ТекущаяДата(),СушКамера,Неисправна);	
КонецПроцедуры 

&НаКлиенте
Процедура ВопросПриИзмененииСостоянияКамеры(Вопрос,НомерКамеры,ЦветКамеры,ИмяГруппыКамеры,Картинка,СсылкаСушКамера,Неисправна)
	
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаПоИзменениюСостоянияКамеры",
	ЭтотОбъект,Новый Структура("НомерКамеры,ЦветКамеры,ИмяГруппыКамеры,Картинка,СсылкаСушКамера,Неисправна",НомерКамеры,ЦветКамеры,ИмяГруппыКамеры,Картинка,СсылкаСушКамера,Неисправна));	
	
	ПоказатьВопрос(Оповещение,
	Вопрос,
	РежимДиалогаВопрос.ДаНет,
	0, 
	КодВозвратаДиалога.Да, 
	"Внимание!" 
	);    
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаПоИзменениюСостоянияКамеры(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат = КодВозвратаДиалога.Да Тогда 
		Элементы[Параметры.ИмяГруппыКамеры].ЦветФона = Параметры.ЦветКамеры;
		Элементы["Неисправна"+Параметры.НомерКамеры].Картинка = Параметры.Картинка;
		ДобавитьЗаписьОСостоянииКамеры(Параметры.СсылкаСушКамера,Параметры.Неисправна);
		Если Параметры.Неисправна Тогда       
			ДоступностьКнопкиЗагрузить = Ложь;
		Иначе 
			ДоступностьКнопкиЗагрузить = Истина;
		КонецЕсли;
		УстановитьДоступностьЗагрузкиВыгрузки(Параметры.НомерКамеры,Ложь,ДоступностьКнопкиЗагрузить);
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Процедура УстановитьНеисправностьКамер() 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	алк_СостояниеСушильныхКамерСрезПоследних.СушильнаяКамера КАК СушильнаяКамера,
	               |	алк_СостояниеСушильныхКамерСрезПоследних.Неисправна КАК Неисправна
	               |ИЗ
	               |	РегистрСведений.алк_СостояниеСушильныхКамер.СрезПоследних КАК алк_СостояниеСушильныхКамерСрезПоследних
	               |ГДЕ
	               |	алк_СостояниеСушильныхКамерСрезПоследних.СушильнаяКамера.Владелец.Код В (""ПБ-000031"", ""ПБ-000090"")";
	РезЗапроса = Запрос.Выполнить();
	Если РезЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	Выборка = РезЗапроса.Выбрать();  
	Пока Выборка.Следующий() Цикл  
		ЦифрыНомера =  УстановитьНомерКамерыПоШтабелю(Выборка.СушильнаяКамера);
		Если Выборка.Неисправна Тогда 
			Картинка = БиблиотекаКартинок.ОформлениеФлагКрасный;
			Элементы["Группа2"+ЦифрыНомера].ЦветФона = НазначитьЦвет().Серый; 
			УстановитьДоступностьЗагрузкиВыгрузки(ЦифрыНомера,Ложь,Ложь);
		Иначе 
			ЦифрыНомера = УстановитьНомерКамерыПоШтабелю(Выборка.СушильнаяКамера);
			Картинка = БиблиотекаКартинок.ОформлениеФлагЗеленый;; 
		КонецЕсли;
		Элементы["Неисправна"+ЦифрыНомера].Картинка = Картинка;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область СушильныйКомплекс

#Область СлужебныеПроцедурыИФункции 
//общая процедура для суш комплекса №1 и №2
&НаСервере
Процедура ЗаполнитьСушильныйКомплекс() 
	
	Запрос = Новый Запрос;
		
	Запрос.Текст = "ВЫБРАТЬ
	               |	алк_ОстаткиЗапасовОстатки.Штабель КАК Штабель,
	               |	алк_ОстаткиЗапасовОстатки.СерийныйНомер КАК СерийныйНомер,
				   |    алк_ОстаткиЗапасовОстатки.КоличествоОстаток КАК КоличествоОстаток,
	               |	алк_ЗагрузкаВКамеру.Дата КАК Дата,
	               |	алк_ЗагрузкаВКамеру.Ссылка КАК Ссылка,
	               |	алк_ЗагрузкаВКамеру.ДатаВыгрузки КАК ДатаВыгрузки
	               |ИЗ
	               |	РегистрНакопления.алк_ОстаткиЗапасов.Остатки(
	               |			,
	               |			Номенклатура.КатегорияНоменклатуры = &ПиломатериалСП
	               |				И СтруктурнаяЕдиница В (&СкладыСушКомплекса)) КАК алк_ОстаткиЗапасовОстатки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.алк_ПроизводствоОборот.Обороты(
	               |				,
	               |				,
	               |				Авто,
	               |				Номенклатура.КатегорияНоменклатуры = &ПиломатериалСП
	               |					И Склад В (&СкладыСушКомплекса)
	               |					И Операция = ЗНАЧЕНИЕ(Справочник.алк_ОперацииПроизводства.Сушка)
	               |					И ВидДвиженияПроизводства = ЗНАЧЕНИЕ(Перечисление.алк_ВидыДвиженияПроизводствоОборот.Оприходовано)) КАК алк_ПроизводствоОборотОбороты
	               |			ЛЕВОЕ СОЕДИНЕНИЕ Документ.алк_ЗагрузкаВКамеру КАК алк_ЗагрузкаВКамеру
	               |			ПО алк_ПроизводствоОборотОбороты.Регистратор = алк_ЗагрузкаВКамеру.Ссылка
	               |		ПО алк_ОстаткиЗапасовОстатки.СерийныйНомер = алк_ПроизводствоОборотОбороты.СерийныйНомер
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Штабель
	               |ИТОГИ
	               |	СУММА(КоличествоОстаток)
	               |ПО
	               |	Штабель"; 
	
	Запрос.УстановитьПараметр("ПиломатериалСП", НазначитьКатегориюНоменклатуры());
	Запрос.УстановитьПараметр("СкладыСушКомплекса",ПолучитьМассивСкладовСушКомплекса()); //Сушильный комплекс	
	
	Результат = Запрос.Выполнить();
		
	ВыборкаШтабель = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаШтабель.Следующий() Цикл 
		
		Если ВыборкаШтабель.Штабель <> Справочники.алк_Штабели.ПустаяСсылка() Тогда  
			
			Выборка = ВыборкаШтабель.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
				ЗаполнениеШтабеля(Выборка.Штабель,Истина,Ложь,Ложь,Выборка.Дата, Выборка.ДатаВыгрузки, Выборка.Ссылка,,,НазначитьЦвет().Зеленый);
				
				УстановитьДоступностьЗагрузкиВыгрузки(УстановитьНомерКамерыПоШтабелю(Выборка.Штабель),Истина,Ложь);
								
				Прервать;	
			КонецЦикла;	
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры 
//для сушильных камер проверка
&НаСервере
Процедура ПроверкаКамерНаВыгрузку(ПовторнаяПроверка)
	
	//суш комплекс №1
	Для Камеры = 1 По 14 Цикл 
		ПроверитьКамеру(Камеры); 
		Если ПовторнаяПроверка Тогда 
			ПроверитьКамеруПовторно(Камеры);
		КонецЕсли;
	КонецЦикла;
	
	//суш комплекс №2
	Для Камеры = 1 По 12 Цикл 
		Камеры2 = "2"+ Камеры; 
		ПроверитьКамеру(Камеры2);
		Если ПовторнаяПроверка Тогда 
			ПроверитьКамеруПовторно(Камеры2);
		КонецЕсли;
	КонецЦикла;
	                           
КонецПроцедуры
//закрашивает в розовый, если просрочена дата выгрузки
&НаСервере
Процедура ПроверитьКамеру(Камеры) 
	
	ДатаВыгрузки = ЭтаФорма[Формат("ДатаПредполагаемойВыгрузки"+Камеры,"ЧГ=0")]; 
	
	Если ДатаВыгрузки > ТекущаяДата() ИЛИ ДатаВыгрузки = Дата(1,1,1)  Тогда
		Возврат;
	КонецЕсли; 
	
	Элементы[Формат("Группа2"+Камеры,"ЧГ=0")].ЦветФона = НазначитьЦвет().Розовый; 
	
КонецПроцедуры
//закрашивает в белый, если камера выгружена
&НаСервере
Процедура ПроверитьКамеруПовторно(Камеры) 
	
	Если ЭтаФорма[Формат("ДокументЗагрузки"+Камеры,"ЧГ=0")] = Документы.алк_ЗагрузкаВКамеру.ПустаяСсылка() Тогда
		УстановитьДоступностьЗагрузкиВыгрузки(Камеры,Ложь,Истина);
		Элементы[Формат("Группа2"+Камеры,"ЧГ=0")].ЦветФона = НазначитьЦвет().Белый; 
	КонецЕсли;
	
КонецПроцедуры
&НаСервере
Процедура УстановитьДоступностьЗагрузкиВыгрузки(НомерКамеры, ДоступностьКомандыВыгрузитьКамеру, ДоступностьКомандыЗагрузитьКамеру)
	
	//скрыть поля
	Элементы["ЗагрузитьКамеру"+НомерКамеры].Доступность = ДоступностьКомандыЗагрузитьКамеру;
	Элементы[Формат("ВыгрузитьКамеру"+НомерКамеры,"ЧГ=0")].Доступность = ДоступностьКомандыВыгрузитьКамеру;
	//\\

КонецПроцедуры
&НаСервереБезКонтекста
Функция ПолучитьМассивСкладовСушКомплекса()
	
	Склады = Новый Массив;
	
	ВсеСкладыСтруктура = НазначитьСклад();
	
	Склады.Добавить(ВсеСкладыСтруктура.СушильныйКомплекс1);
	Склады.Добавить(ВсеСкладыСтруктура.СушильныйКомплекс2);
	Склады.Добавить(ВсеСкладыСтруктура.СушильныйБуфер);
	
	Возврат Склады;
	
КонецФункции
#КонецОбласти 

#КонецОбласти 

#Область Ангар

#Область СлужебныеПроцедурыИФункции 

&НаСервере
Процедура ЗаполнитьАнгар(ПерезаполнитьДругиеШтабели) 
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = ТекстЗапросаОстаткиПоШтабелю();
	
	Запрос.УстановитьПараметр("ПиломатериалСП", НазначитьКатегориюНоменклатуры());
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", МассивАнгаров()); //Ангар 1 + 2 
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ЗаполненныеШтабели = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Штабель <> Справочники.алк_Штабели.ПустаяСсылка() Тогда  
			
			ЗаполнениеШтабеля(Выборка.Штабель,Ложь,Истина,Ложь,,,,Выборка.Объем, Выборка.КоличествоПакетов, НазначитьЦвет().Коричневый);
			
			ЗаполненныеШтабели.Добавить(УстановитьНомерКамерыПоШтабелю(Выборка.Штабель));
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если Не ПерезаполнитьДругиеШтабели Тогда
		Возврат;
	КонецЕсли;
	
	ПерезаполнитьНеЗаполненныеШтабели(1,17,ЗаполненныеШтабели, "ОстатокОбъемАнгар", "ОстатокКоличествоАнгар", "ГруппаА",Ложь); //Сначала для Ангара 1 
	
	ПерезаполнитьНеЗаполненныеШтабели(1,17,ЗаполненныеШтабели, "ОстатокОбъемАнгар", "ОстатокКоличествоАнгар", "ГруппаА",Истина); //Потом для Ангара 2


КонецПроцедуры
&НаСервереБезКонтекста
Функция МассивАнгаров()
	
	Ангары = Новый Массив;
	
	ВсеСкладыСтруктура = НазначитьСклад();
	
	Ангары.Добавить(ВсеСкладыСтруктура.Ангар1);
	Ангары.Добавить(ВсеСкладыСтруктура.Ангар2);
		
	Возврат Ангары;
	
КонецФункции

#КонецОбласти 

#КонецОбласти 

#Область ХолоднаяЗона

#Область СлужебныеПроцедурыИФункции 

&НаСервере
Процедура ЗаполнитьХолоднаяЗона(ПерезаполнитьДругиеШтабели)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = ТекстЗапросаОстаткиПоШтабелю();
	
	Запрос.УстановитьПараметр("ПиломатериалСП", НазначитьКатегориюНоменклатуры());
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", НазначитьСклад().ХолоднаяЗона);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ЗаполненныеШтабели = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Штабель <> Справочники.алк_Штабели.ПустаяСсылка() Тогда 
			
			ЗаполнениеШтабеля(Выборка.Штабель,Ложь,Ложь,Истина,,,,Выборка.Объем, Выборка.КоличествоПакетов, НазначитьЦвет().Голубой);
			
			ЗаполненныеШтабели.Добавить(УстановитьНомерКамерыПоШтабелю(Выборка.Штабель)); 
			
		КонецЕсли;
		
	КонецЦикла; 
	
	Если Не ПерезаполнитьДругиеШтабели Тогда 
		Возврат;
	КонецЕсли;
	
	ПерезаполнитьНеЗаполненныеШтабели(1,7,ЗаполненныеШтабели,"ОстатокОбъемХЗ","ОстатокКоличествоХЗ","Группа3",Ложь);
	
КонецПроцедуры

#КонецОбласти 

#КонецОбласти 

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ) 
		
	//Заполняем сушильные камеры
	ЗаполнитьСушильныйКомплекс();
	//\\ 
	
	//Заполняем Ангар
	ЗаполнитьАнгар(Ложь); 
	//\\  
	
	//Заполняем Холодную зону
	ЗаполнитьХолоднаяЗона(Ложь);
	//\\
	
	ПроверкаКамерНаВыгрузку(Ложь); 
	
	ВывестиОстаткиПоСкладам(МассивСкладов());
	
	УстановитьНеисправностьКамер();
	
	ПодключитьОбработчикОжидания("ОбновитьДанныеНаФорме", 60);
		
КонецПроцедуры 

#КонецОбласти 

#Область КомандыФормы

&НаКлиенте
Процедура ВыгрузитьКамеру(Команда)
	
	НомерКамеры = ПолучитьНомерКамерыПоТекущемуЭлементу("у",2);
	  
   	Форма = ПолучитьФорму("Документ.алк_ВыгрузкаИзКамеры.ФормаОбъекта",Новый Структура("ПрограммноеСозданиеНаОсновании",Истина));
	ДанныеФормы = Форма.Объект; 
	ВыгрузитьКамеруНаСервере(НомерКамеры, ДанныеФормы);
	КопироватьДанныеФормы(ДанныеФормы,Форма.Объект);
	Форма.Открыть(); 
    	
	//очистить поля камеры и скрыть
	ЭтаФорма[Формат("ДокументЗагрузки"+НомерКамеры,"ЧГ=0")] = ""; 	
	ЭтаФорма[Формат("ДатаЗагрузки"+НомерКамеры,"ЧГ=0")] = "";
	ЭтаФорма[Формат("ДатаПредполагаемойВыгрузки"+НомерКамеры,"ЧГ=0")] = ""; 
	//\\ 
	
	УстановитьДоступностьЗагрузкиВыгрузки(НомерКамеры,Ложь,Истина);
	
	//цвет группы
	Элементы[Формат("Группа2"+НомерКамеры,"ЧГ=0")].ЦветФона = НазначитьЦвет().Белый; 
	//\\

КонецПроцедуры

&НаКлиенте
Асинх Процедура ЗагрузитьКамеру(Команда)
	
	НомерКамеры = ПолучитьНомерКамерыПоТекущемуЭлементу("у",2);
	
	Форма = ПолучитьФорму("Документ.алк_ЗагрузкаВКамеру.ФормаОбъекта");
	ДанныеФормы = Форма.Объект;
	ЗагрузитьКамеруНаСервере(ДанныеФормы,НомерКамеры);
	КопироватьДанныеФормы(ДанныеФормы,Форма.Объект);
	Форма.Открыть(); 
	
	Если ДанныеФормы.СтруктурнаяЕдиницаПолучатель = НазначитьСклад().СушильныйКомплекс2 Тогда 
		НомерКамеры = "2" + НомерКамеры;
	КонецЕсли;
	
	УстановитьДоступностьЗагрузкиВыгрузки(НомерКамеры,Истина,Ложь);
	
	//цвет группы
	Элементы[Формат("Группа2"+НомерКамеры,"ЧГ=0")].ЦветФона = НазначитьЦвет().Зеленый; 
	//\\
	
КонецПроцедуры

//команда обновить
&НаКлиенте
Процедура ОбновитьДанные(Команда)  
	
	ОбновитьДанныеНаФормеНаСервере();
	 	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ОткрытьДокумент(Команда)
	
	НомерКамеры = ПолучитьНомерКамерыПоТекущемуЭлементу("т",3);
	
	ОткрытьЗначениеАсинх(ЭтаФорма[Формат("ДокументЗагрузки"+НомерКамеры,"ЧГ=0")]);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКамеру(Команда)
	
	ВсеСклады = НазначитьСклад();
	
	НомерКамеры = ПолучитьНомерКамерыПоТекущемуЭлементу("_",1);
	Склад = ПолучитьСклад("у",1,НомерКамеры); 
	
	Если Склад = НазначитьСклад().Ангар2 Тогда 
		НомерКамеры = Сред(НомерКамеры,2); //уберем двойку вначале
	КонецЕсли;
			
	ВызватьФормуСодержаниеКамеры(Склад, ПолучитьШтабель("№ " + НомерКамеры, Склад), НазначитьКатегориюНоменклатуры());

КонецПроцедуры

//отметить/снять пометку о неисправности камеры
&НаКлиенте
Процедура Неисправна(Команда)
	
	НомерКамеры = ПолучитьНомерКамерыПоТекущемуЭлементу("а",2); 
	ЦветКамеры = Элементы["Группа2"+НомерКамеры].ЦветФона;
	
	Если ЗначениеЗаполнено(ЭтаФорма["ДокументЗагрузки" + НомерКамеры]) Тогда  //ЦветКамеры <> НазначитьЦвет().Серый И ЦветКамеры <> НазначитьЦвет().Белый Тогда
		Сообщить("Нельзя пометить неисправной заполненную камеру!");
		Возврат;
	КонецЕсли;     
	
	ВсеСклады = НазначитьСклад();
	
	Если Сред(НомерКамеры,1,1) = "2" И СтрДлина(НомерКамеры) <> 1 Тогда 
		СкладПолучатель = ВсеСклады.СушильныйКомплекс2;
		НомерКамерыДляСсылки = Сред(НомерКамеры,2);
	Иначе 
		СкладПолучатель = ВсеСклады.СушильныйКомплекс1;  
		НомерКамерыДляСсылки = НомерКамеры;
	КонецЕсли;
	
	СушКамера = ПолучитьШтабель("Сушильная камера № " + НомерКамерыДляСсылки,СкладПолучатель); 
	
	Если ЦветКамеры <> НазначитьЦвет().Серый Тогда 
		ВопросПриИзмененииСостоянияКамеры("Отметить камеру, как неисправную?",НомерКамеры,НазначитьЦвет().Серый,"Группа2"+НомерКамеры,БиблиотекаКартинок.ОформлениеФлагКрасный,СушКамера,Истина);
	Иначе
		ВопросПриИзмененииСостоянияКамеры("Снять пометку о неисправности камеры?",НомерКамеры,НазначитьЦвет().Белый,"Группа2"+НомерКамеры,БиблиотекаКартинок.ОформлениеФлагЗеленый,СушКамера,Ложь);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьИсториюНеисправностей(Команда)
	ОткрытьФорму("Обработка.ГрафическоеОтображениеСушКомплекса.Форма.ФормаИсторииНеисправностей",, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
КонецПроцедуры


#КонецОбласти
